In [1]:
import pandas as pd
import numpy as np

## 과제 1: groupby

In [2]:
transactions = pd.read_csv('./data/retail/transactions.csv', parse_dates=['date'])
transactions.head()

        date  store_nbr  transactions
0 2013-01-01         25           770
1 2013-01-02          1          2111
2 2013-01-02          2          2358
3 2013-01-02          3          3487
4 2013-01-02          4          1922

In [3]:
(
    transactions
    .groupby('store_nbr')[['transactions']]
    .sum()
    .sort_values('transactions', ascending=False)
).iloc[:10]

           transactions
store_nbr
44              7273093
47              6535810
45              6201115
46              5990113
3               5366350
48              5107785
8               4637971
49              4574103
50              4384444
11              3972488

## 과제 2: groupby
Multiple Columns

In [4]:
transactions['month'] = transactions['date'].dt.month
transactions.head()

        date  store_nbr  transactions  month
0 2013-01-01         25           770      1
1 2013-01-02          1          2111      1
2 2013-01-02          2          2358      1
3 2013-01-02          3          3487      1
4 2013-01-02          4          1922      1

In [5]:
(
    transactions
    .groupby(['store_nbr', 'month'])[['transactions']]
    .sum()
    .sort_values(['month', 'transactions'], ascending=[True, False])
)

                 transactions
store_nbr month
44        1            628438
47        1            568824
45        1            538370
46        1            522763
3         1            463260
...                       ...
32        12            86167
21        12            84128
42        12            76741
29        12            76627
22        12            50650

[641 rows x 1 columns]